In [1]:
import pandas as pd

In [19]:
df = pd.read_csv('~/Downloads/CCRB-Complaint-Data_202007261025/allegations_20200726939.csv')
uni=pd.read_csv('~/Downloads/Copy of US Higher Education_ Value vs. Vulnerability.csv')

In [20]:
df.head(2)

,unique_mos_id,first_name,last_name,command_now,complaint_id,month_received,year_received,month_closed,year_closed,command_at_incident,...,mos_age_incident,complainant_ethnicity,complainant_gender,complainant_age_incident,fado_type,allegation,precinct,contact_reason,outcome_description,board_disposition
0,10004,Jonathan,Ruiz,078 PCT,42835,7,2019,5,2020,078 PCT,...,32,Black,Female,38.0,Abuse of Authority,Failure to provide RTKA card,78.0,Report-domestic dispute,No arrest made or summons issued,Substantiated (Command Lvl Instructions)
1,10007,John,Sears,078 PCT,24601,11,2011,8,2012,PBBS,...,24,Black,Male,26.0,Discourtesy,Action,67.0,Moving violation,Moving violation summons issued,Substantiated (Charges)

In [21]:
# Who has the most records?
# how often did the person get complaint?
# Race and gender of the complainent?
# what kind allegation depending on race and gender?
# which percinct has the most allegations againts?
# does getting certain amount of allegation get you arrested or fired?

In [23]:
uni.head(2)

,Average,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,59%,Unnamed: 7,"52,912",Unnamed: 9,...,"$36,056",Unnamed: 22,Unnamed: 23,Unnamed: 24,"$154,780",Unnamed: 26,6%,Unnamed: 28,Unnamed: 29,Unnamed: 30
0,Median,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,0.43,NaN,NaN,NaN,NaN,0.95,NaN
1,Total Points,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,1.00,27.00,1.00,NaN,NaN,NaN,NaN,2.00,NaN

In [24]:
uni.melt()

          variable               value
0          Average              Median
1          Average        Total Points
2          Average              Source
3          Average    Institution Name
4          Average  Adelphi University
...            ...                 ...
30468  Unnamed: 30                 NaN
30469  Unnamed: 30                 NaN
30470  Unnamed: 30                 NaN
30471  Unnamed: 30                 NaN
30472  Unnamed: 30                 NaN

[30473 rows x 2 columns]

In [25]:
uni.columns

Index(['Average', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', '59%', 'Unnamed: 7', '52,912', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13', '$296,037',
       'Unnamed: 15', '$804,297', 'Unnamed: 17', '$11,203', 'Unnamed: 19',
       'Unnamed: 20', '$36,056', 'Unnamed: 22', 'Unnamed: 23', 'Unnamed: 24',
       '$154,780', 'Unnamed: 26', '6%', 'Unnamed: 28', 'Unnamed: 29',
       'Unnamed: 30'],
      dtype='object')